tanishqsngl/STM32f103/MotorC+RoboticA+Camera/src/main.c
#include "stm32f10x.h"

void emStop(void)
{
	int b = 0;
    TIM2 -> CR1 |= TIM_CR1_ARPE;
    TIM2 -> PSC = 65535;
    TIM2 -> ARR = 1500;
    TIM2 -> CR1 &= ~(TIM_CR1_CEN);

	while(!(USART1 -> SR & (1<<5)))
	{
		TIM2 -> CR1 |= TIM_CR1_CEN;
		b = TIM2 -> CNT;
		if(b >= 1500)
		{
			TIM3 -> CCR4 = 0;//FL
			TIM3 -> CCR3 = 0;//FR
			TIM1 -> CCR2 = 0;
			TIM1 -> CCR3 = 0;
			TIM1 -> CCR1 = 0;
			GPIOC -> BSRR |= GPIO_BSRR_BR13;
			GPIOC -> BSRR |= GPIO_BSRR_BR14;
			GPIOA -> BSRR |= GPIO_BSRR_BR4;
			GPIOA -> BSRR |= GPIO_BSRR_BR5;
			TIM3 -> CCR1 = 0;
			TIM3 -> CCR2 = 0;
			GPIOA -> BSRR |= GPIO_BSRR_BR11;
			GPIOA -> BSRR |= GPIO_BSRR_BR12;
			GPIOA -> BSRR |= GPIO_BSRR_BR0;
			GPIOA -> BSRR |= GPIO_BSRR_BR1;
			GPIOA -> BSRR |= GPIO_BSRR_BR2;
			GPIOC -> BSRR |= GPIO_BSRR_BR15;
			GPIOB -> BSRR |= GPIO_BSRR_BR5;
			GPIOB -> BSRR |= GPIO_BSRR_BR6;
			GPIOB -> BSRR |= GPIO_BSRR_BR7;
			GPIOB -> BSRR |= GPIO_BSRR_BR8;
			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
	}
	TIM2 -> CNT = 0;
}

void timerSetup(void)
{
	//Wheel Motor
	TIM3 -> CR1 &= ~(TIM_CR1_ARPE);
	TIM3 -> CR1 &= ~(TIM_CR1_UDIS);
	TIM3 -> CCMR2 |= TIM_CCMR2_OC3M_2;
	TIM3 -> CCMR2 &= ~(TIM_CCMR2_OC3M_1);
	TIM3 -> CCMR2 |= (TIM_CCMR2_OC3M_0);
	TIM3 -> CCMR2 |= TIM_CCMR2_OC3PE;
	TIM3 -> CCMR2 |= TIM_CCMR2_OC4M_2;
	TIM3 -> CCMR2 &= ~(TIM_CCMR2_OC4M_1);
	TIM3 -> CCMR2 |= TIM_CCMR2_OC4M_0;
	TIM3 -> CCMR2 |= TIM_CCMR2_OC4PE;
	TIM3 -> CCER &= ~(TIM_CCER_CC3E);
	TIM3 -> CCER |= (TIM_CCER_CC3P);
	TIM3 -> CCER &= ~(TIM_CCER_CC4E);
	TIM3 -> CCER |= (TIM_CCER_CC4P);
	TIM3 -> DIER |= TIM_DIER_UIE;
	TIM3 -> ARR = 32768;
	TIM3 -> PSC = 0;
	TIM3 -> EGR |= TIM_EGR_UG;
	TIM3 -> CR1 &= ~(TIM_CR1_CEN);
	TIM3 -> CCR3 = 0;
	TIM3 -> CCR4 = 0;

	//rArm
	TIM3 -> CCMR1 |= TIM_CCMR1_OC1M_2;
	TIM3 -> CCMR1 &= ~(TIM_CCMR1_OC1M_1);
	TIM3 -> CCMR1 |= (TIM_CCMR1_OC1M_0);
	TIM3 -> CCMR1 |= TIM_CCMR1_OC1PE;
	TIM3 -> CCMR1 |= TIM_CCMR1_OC2M_2;
	TIM3 -> CCMR1 &= ~(TIM_CCMR1_OC2M_1);
	TIM3 -> CCMR1 |= TIM_CCMR1_OC2M_0;
	TIM3 -> CCMR1 |= TIM_CCMR1_OC2PE;
	TIM3 -> CCER &= ~(TIM_CCER_CC1E);
	TIM3 -> CCER |= (TIM_CCER_CC1P);
	TIM3 -> CCER &= ~(TIM_CCER_CC2E);
	TIM3 -> CCER |= (TIM_CCER_CC2P);

	//Swivel Base Pins
	//TIM1 -> CR1 |= (TIM_CR1_DIR);
	TIM1 -> CCMR2 |= TIM_CCMR2_OC3M_2;
	TIM1 -> CCMR2 &= ~(TIM_CCMR2_OC3M_1);
	TIM1 -> CCMR2 |= (TIM_CCMR2_OC3M_0);
	TIM1 -> CCMR2 |= TIM_CCMR2_OC3PE;
	TIM1 -> CCMR1 |= TIM_CCMR1_OC2M_2;
	TIM1 -> CCMR1 &= ~(TIM_CCMR1_OC2M_1);
	TIM1 -> CCMR1 |= TIM_CCMR1_OC2M_0;
	TIM1 -> CCMR1 |= TIM_CCMR1_OC2PE;
	TIM1 -> CCER &= ~(TIM_CCER_CC2E);
	TIM1 -> CCER |= (TIM_CCER_CC2P);
	TIM1 -> CCER |= (TIM_CCER_CC2NP);
	TIM1 -> CCER &= ~(TIM_CCER_CC3E);
	TIM1 -> CCER |= (TIM_CCER_CC3P);
	TIM1 -> CCER |= (TIM_CCER_CC3NP);
	//TIM1 -> CCER |= (TIM_CCER_CC3NE);
	//TIM1 -> CCER |= (TIM_CCER_CC2NE);
	TIM1 -> DIER |= TIM_DIER_UIE;
	TIM1 -> ARR = 32768;
	TIM1 -> PSC = 0;
	TIM1 -> EGR |= TIM_EGR_UG;
	TIM1 -> CR1 &= ~(TIM_CR1_CEN);
	TIM1 -> BDTR |= TIM_BDTR_MOE;
	TIM1 -> CCR3 = 0;
	TIM1 -> CCR2 = 0;

	//Camera Pins
	TIM1 -> CCMR1 |= TIM_CCMR1_OC1M_2;
	TIM1 -> CCMR1 &= ~(TIM_CCMR1_OC1M_1);
	TIM1 -> CCMR1 |= TIM_CCMR1_OC1M_0;
	TIM1 -> CCMR1 |= TIM_CCMR1_OC1PE;
	TIM1 -> CCER &= ~(TIM_CCER_CC1E);
	TIM1 -> CCER |= (TIM_CCER_CC1P);
	TIM1 -> CCER &= ~(TIM_CCER_CC1E);
	TIM1 -> CCR1 = 0;
}

void GPIOSetup(void)
{
	//DC Servo Pins
	GPIOA -> CRL |= (GPIO_CRL_MODE0_0);
	GPIOA -> CRL &= ~(GPIO_CRL_MODE0_1);
	GPIOA -> CRL |= GPIO_CRL_MODE1_0;
	GPIOA -> CRL &= ~(GPIO_CRL_MODE1_1);
	GPIOA -> CRL |= (GPIO_CRL_MODE2_0);
	GPIOA -> CRL &= ~(GPIO_CRL_MODE2_1);
	GPIOC -> CRH |= GPIO_CRH_MODE15_0;
	GPIOC -> CRH &= ~(GPIO_CRH_MODE15_1);
	GPIOA -> CRL &= ~(GPIO_CRL_CNF0_0);
	GPIOA -> CRL &= ~(GPIO_CRL_CNF0_1);
	GPIOA -> CRL &= ~(GPIO_CRL_CNF1_0);
	GPIOA -> CRL &= ~(GPIO_CRL_CNF1_1);
	GPIOA -> CRL &= ~(GPIO_CRL_CNF2_0);
	GPIOA -> CRL &= ~(GPIO_CRL_CNF2_1);
	GPIOC -> CRH &= ~(GPIO_CRH_CNF15_0);
	GPIOC -> CRH &= ~(GPIO_CRH_CNF15_1);

	//UART Pins
	GPIOA -> CRH |= (GPIO_CRH_MODE9_0);
	GPIOA -> CRH |= GPIO_CRH_MODE9_1;
	GPIOA -> CRH &= ~(GPIO_CRH_CNF9_0);
	GPIOA -> CRH |= GPIO_CRH_CNF9_1;
	GPIOA -> CRH &= ~(GPIO_CRH_MODE10_0);
	GPIOA -> CRH &= ~(GPIO_CRH_MODE10_1);
	GPIOA -> CRH |= (GPIO_CRH_CNF10_0);
	GPIOA -> CRH &= ~(GPIO_CRH_CNF10_1);

	//Actuator Pins
	GPIOC -> CRH |= (GPIO_CRH_MODE13_0);
	GPIOC -> CRH &= ~(GPIO_CRH_MODE13_1);
	GPIOC -> CRH |= GPIO_CRH_MODE14_0;
	GPIOC -> CRH &= ~(GPIO_CRH_MODE14_1);
	GPIOC -> CRH &= ~(GPIO_CRH_CNF13_0);
	GPIOC -> CRH &= ~(GPIO_CRH_CNF13_1);
	GPIOC -> CRH &= ~(GPIO_CRH_CNF14_0);
	GPIOC -> CRH &= ~(GPIO_CRH_CNF14_1);

	//Pitch Pins
	GPIOA -> CRL |= (GPIO_CRL_MODE4_0);
	GPIOA -> CRL &= ~(GPIO_CRL_MODE4_1);
	GPIOA -> CRL |= GPIO_CRL_MODE5_0;
	GPIOA -> CRL &= ~(GPIO_CRL_MODE5_1);
	GPIOA -> CRL &= ~(GPIO_CRL_CNF4_0);
	GPIOA -> CRL &= ~(GPIO_CRL_CNF4_1);
	GPIOA -> CRL &= ~(GPIO_CRL_CNF5_0);
	GPIOA -> CRL &= ~(GPIO_CRL_CNF5_1);

	//Roll Pins
	GPIOA -> CRL |= (GPIO_CRL_MODE6_0);
	GPIOA -> CRL &= ~(GPIO_CRL_MODE6_1);
	GPIOA -> CRL &= ~(GPIO_CRL_CNF6_0);
	GPIOA -> CRL |= GPIO_CRL_CNF6_1;
	GPIOA -> CRL |= GPIO_CRL_MODE7_0;
	GPIOA -> CRL &= ~(GPIO_CRL_MODE7_1);
	GPIOA -> CRL &= ~(GPIO_CRL_CNF7_0);
	GPIOA -> CRL |= GPIO_CRL_CNF7_1;

	//Gripper Pins
	GPIOA -> CRH |= (GPIO_CRH_MODE11_0);
	GPIOA -> CRH &= ~(GPIO_CRH_MODE11_1);
	GPIOA -> CRH |= GPIO_CRH_MODE12_0;
	GPIOA -> CRH &= ~(GPIO_CRH_MODE12_1);
	GPIOA -> CRH &= ~(GPIO_CRH_CNF11_0);
	GPIOA -> CRH &= ~(GPIO_CRH_CNF11_1);
	GPIOA -> CRH &= ~(GPIO_CRH_CNF12_0);
	GPIOA -> CRH &= ~(GPIO_CRH_CNF12_1);

	//Swivel Base Pins
	GPIOB -> CRH |= (GPIO_CRH_MODE14_0);
	GPIOB -> CRH &= ~(GPIO_CRH_MODE14_1);
	GPIOB -> CRH &= ~(GPIO_CRH_CNF14_0);
	GPIOB -> CRH |= GPIO_CRH_CNF14_1;
	GPIOB -> CRH |= GPIO_CRH_MODE15_0;
	GPIOB -> CRH &= ~(GPIO_CRH_MODE15_1);
	GPIOB -> CRH &= ~(GPIO_CRH_CNF15_0);
	GPIOB -> CRH |= GPIO_CRH_CNF15_1;

	//Wheel Motor Pins
	GPIOB -> CRL |= (GPIO_CRL_MODE0_0);
	GPIOB -> CRL |= GPIO_CRL_MODE0_1;
	GPIOB -> CRH |= GPIO_CRH_MODE10_0;
	GPIOB -> CRH |= (GPIO_CRH_MODE10_1);
	GPIOB -> CRL &= ~(GPIO_CRL_CNF0_0);
	GPIOB -> CRL |= GPIO_CRL_CNF0_1;
	GPIOB -> CRH &= ~(GPIO_CRH_CNF10_0);
	GPIOB -> CRH &= ~(GPIO_CRH_CNF10_1);
	GPIOB -> CRL |= GPIO_CRL_MODE1_0;
	GPIOB -> CRL |= (GPIO_CRL_MODE1_1);
	GPIOB -> CRH |= GPIO_CRH_MODE11_0;
	GPIOB -> CRH |= (GPIO_CRH_MODE11_1);
	GPIOB -> CRL &= ~(GPIO_CRL_CNF1_0);
	GPIOB -> CRL |= GPIO_CRL_CNF1_1;
	GPIOB -> CRH &= ~(GPIO_CRH_CNF11_0);
	GPIOB -> CRH &= ~(GPIO_CRH_CNF11_1);

	//Camera A8 B56789
	GPIOB -> CRL |= GPIO_CRL_MODE5_0;
	GPIOB -> CRL &= ~(GPIO_CRL_MODE5_1);
	GPIOB -> CRL |= GPIO_CRL_MODE6_0;
	GPIOB -> CRL &= ~(GPIO_CRL_MODE6_1);
	GPIOB -> CRL |= GPIO_CRL_MODE7_0;
	GPIOB -> CRL &= ~(GPIO_CRL_MODE7_1);
	GPIOB -> CRH |= GPIO_CRH_MODE8_0;
	GPIOB -> CRH &= ~(GPIO_CRH_MODE8_1);
	GPIOB -> CRH |= GPIO_CRH_MODE9_0;
	GPIOB -> CRH &= ~(GPIO_CRH_MODE9_1);
	GPIOB -> CRL &= ~(GPIO_CRL_CNF5_0);
	GPIOB -> CRL &= ~(GPIO_CRL_CNF5_1);
	GPIOB -> CRL &= ~(GPIO_CRL_CNF6_0);
	GPIOB -> CRL &= ~(GPIO_CRL_CNF6_1);
	GPIOB -> CRL &= ~(GPIO_CRL_CNF7_0);
	GPIOB -> CRL &= ~(GPIO_CRL_CNF7_1);
	GPIOB -> CRH &= ~(GPIO_CRH_CNF8_0);
	GPIOB -> CRH &= ~(GPIO_CRH_CNF8_1);
	GPIOB -> CRH &= ~(GPIO_CRH_CNF9_0);
	GPIOB -> CRH &= ~(GPIO_CRH_CNF9_1);
	GPIOA -> CRH |= GPIO_CRH_MODE8_0;
	GPIOA -> CRH &= ~(GPIO_CRH_MODE8_1);
	GPIOA -> CRH &= ~(GPIO_CRH_CNF8_0);
	GPIOA -> CRH |= GPIO_CRH_CNF8_1;
}

void UARTSetup(void)
{
	//UART
	USART1 -> CR1 |= USART_CR1_UE;
	USART1 -> BRR = 0x271;//EA6(9600 36) 271(57600 36) 4E2(57600 72) 753(38400 72)
	USART1 -> CR1 &= ~(USART_CR1_M);//8 data bits
	USART1 -> CR1 |= USART_CR1_RXNEIE;
	USART1 -> CR1 |= USART_CR1_IDLEIE;
	USART1 -> CR3 &= ~(USART_CR3_RTSE);
}

void DCServoF(uint32_t aDelay)
{
	GPIOA -> BSRR |= GPIO_BSRR_BS0;
	GPIOA -> BSRR |= GPIO_BSRR_BR1;
	GPIOA -> BSRR |= GPIO_BSRR_BR2;
	GPIOC -> BSRR |= GPIO_BSRR_BR15;

