tanishqsngl/STM32f103/MotorC+RoboticA+Camera/src/main.c
void RoboticArm(uint32_t A)
{
	uint16_t sBase = 0;
	uint16_t sBase1 = 0;
	uint32_t roll = 0;
	uint32_t roll1 = 0;
	uint16_t servoD = 0;
	uint16_t servoD1 = 0;

	if(A=='s' || A=='S')//s or S Swivel Base
	{
		TIM3 -> CCR1 = 0;
		TIM3 -> CCR2 = 0;
		TIM1 -> CCR1 = 0;

		for(int i=0;i<4;i++)
		{
			emStop();
			sBase = sBase - 48;
			sBase1 = sBase1*10 + sBase;
		}
		//Main code for swivel base
		TIM1 -> CR1 |= TIM_CR1_CEN;
		TIM1 -> CCER |= TIM_CCER_CC3NE;
		TIM1 -> CCER |= TIM_CCER_CC2NE;

		TIM1 -> CCMR2 |= TIM_CCMR2_OC3M_2;
		TIM1 -> CCMR2 |= TIM_CCMR2_OC3M_1;
		TIM1 -> CCMR2 |= TIM_CCMR2_OC3M_0;
		TIM1 -> CCMR1 |= TIM_CCMR1_OC2M_2;
		TIM1 -> CCMR1 |= TIM_CCMR1_OC2M_1;
		TIM1 -> CCMR1 |= TIM_CCMR1_OC2M_0;

		for(int i=0;i<2;i++)
		{
			emStop();
			sBase = USART1-> DR;
			sBase = sBase - 48;
			sBase1 = sBase1*10 + sBase;
		}

		sBase1 = sBase1-12;
		sBase1 = sBase1*1260;

		if(A=='s')//s forward
		{
			TIM1 -> CCR2 = sBase1;
			TIM1 -> CCR3 = 0;

//			GPIOC -> BSRR |= GPIO_BSRR_BR13;
//			GPIOC -> BSRR |= GPIO_BSRR_BR14;
//			GPIOA -> BSRR |= GPIO_BSRR_BR4;
//			GPIOA -> BSRR |= GPIO_BSRR_BR5;
//			TIM3 -> CCR1 = 0;
//			TIM3 -> CCR2 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR11;
//			GPIOA -> BSRR |= GPIO_BSRR_BR12;
//			GPIOA -> BSRR |= GPIO_BSRR_BR0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR1;
//			GPIOA -> BSRR |= GPIO_BSRR_BR2;
//			GPIOC -> BSRR |= GPIO_BSRR_BR15;
//			GPIOA -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR5;
//			GPIOB -> BSRR |= GPIO_BSRR_BR6;
//			GPIOB -> BSRR |= GPIO_BSRR_BR7;
//			GPIOB -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
		else if(A=='S')//S backward
		{
			TIM1 -> CCR2 = sBase1;
			TIM1 -> CCR3 = 32768;

//			GPIOC -> BSRR |= GPIO_BSRR_BR13;
//			GPIOC -> BSRR |= GPIO_BSRR_BR14;
//			GPIOA -> BSRR |= GPIO_BSRR_BR4;
//			GPIOA -> BSRR |= GPIO_BSRR_BR5;
//			TIM3 -> CCR1 = 0;
//			TIM3 -> CCR2 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR11;
//			GPIOA -> BSRR |= GPIO_BSRR_BR12;
//			GPIOA -> BSRR |= GPIO_BSRR_BR0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR1;
//			GPIOA -> BSRR |= GPIO_BSRR_BR2;
//			GPIOC -> BSRR |= GPIO_BSRR_BR15;
//			GPIOA -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR5;
//			GPIOB -> BSRR |= GPIO_BSRR_BR6;
//			GPIOB -> BSRR |= GPIO_BSRR_BR7;
//			GPIOB -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
	}

	if(A=='t' || A=='T')//DC Servo
	{
		for(int i=0;i<2;i++)
		{
			emStop();
			servoD = USART1 -> DR;
			servoD = servoD-48;
			servoD1 = servoD1*10 + servoD;
		}

		servoD1 = servoD1-12;
		//servoD1 = servoD1;

		if(A=='t')//t
		{
			//DC Servo forward A0 A1 A2 C15
			DCServoF(servoD1);

//			GPIOC -> BSRR |= GPIO_BSRR_BR13;
//			GPIOC -> BSRR |= GPIO_BSRR_BR14;
//			GPIOA -> BSRR |= GPIO_BSRR_BR4;
//			GPIOA -> BSRR |= GPIO_BSRR_BR5;
//			TIM3 -> CCR1 = 0;
//			TIM3 -> CCR2 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR11;
//			GPIOA -> BSRR |= GPIO_BSRR_BR12;
//			TIM1 -> CCR2 = 0;
//			TIM1 -> CCR3 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR5;
//			GPIOB -> BSRR |= GPIO_BSRR_BR6;
//			GPIOB -> BSRR |= GPIO_BSRR_BR7;
//			GPIOB -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}

		else if(A=='T')//T
		{
			//DC Servo backward
			DCServoB(servoD1);

//			GPIOC -> BSRR |= GPIO_BSRR_BR13;
//			GPIOC -> BSRR |= GPIO_BSRR_BR14;
//			GPIOA -> BSRR |= GPIO_BSRR_BR4;
//			GPIOA -> BSRR |= GPIO_BSRR_BR5;
//			TIM3 -> CCR1 = 0;
//			TIM3 -> CCR2 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR11;
//			GPIOA -> BSRR |= GPIO_BSRR_BR12;
//			TIM1 -> CCR2 = 0;
//			TIM1 -> CCR3 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR5;
//			GPIOB -> BSRR |= GPIO_BSRR_BR6;
//			GPIOB -> BSRR |= GPIO_BSRR_BR7;
//			GPIOB -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
	}

	if(A=='b' || A=='B')//B b actuator
	{
		if(A=='b')//b forward
		{
			GPIOC -> BSRR |= GPIO_BSRR_BS13;
			GPIOC -> BSRR |= GPIO_BSRR_BR14;

//			GPIOA -> BSRR |= GPIO_BSRR_BR4;
//			GPIOA -> BSRR |= GPIO_BSRR_BR5;
//			TIM3 -> CCR1 = 0;
//			TIM3 -> CCR2 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR11;
//			GPIOA -> BSRR |= GPIO_BSRR_BR12;
//			GPIOA -> BSRR |= GPIO_BSRR_BR0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR1;
//			GPIOA -> BSRR |= GPIO_BSRR_BR2;
//			GPIOC -> BSRR |= GPIO_BSRR_BR15;
//			TIM1 -> CCR2 = 0;
//			TIM1 -> CCR3 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR5;
//			GPIOB -> BSRR |= GPIO_BSRR_BR6;
//			GPIOB -> BSRR |= GPIO_BSRR_BR7;
//			GPIOB -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
		else if(A=='B')//B backward
		{
			GPIOC -> BSRR |= GPIO_BSRR_BS13;
			GPIOC -> BSRR |= GPIO_BSRR_BS14;

//			GPIOA -> BSRR |= GPIO_BSRR_BR4;
//			GPIOA -> BSRR |= GPIO_BSRR_BR5;
//			TIM3 -> CCR1 = 0;
//			TIM3 -> CCR2 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR11;
//			GPIOA -> BSRR |= GPIO_BSRR_BR12;
//			GPIOA -> BSRR |= GPIO_BSRR_BR0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR1;
//			GPIOA -> BSRR |= GPIO_BSRR_BR2;
//			GPIOC -> BSRR |= GPIO_BSRR_BR15;
//			TIM1 -> CCR2 = 0;
//			TIM1 -> CCR3 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR5;
//			GPIOB -> BSRR |= GPIO_BSRR_BR6;
//			GPIOB -> BSRR |= GPIO_BSRR_BR7;
//			GPIOB -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
	}

	if(A=='p' || A=='P')//Pitch p and P
	{
		if(A=='p')//forward
		{
			GPIOA -> BSRR |= GPIO_BSRR_BS4;
			GPIOA -> BSRR |= GPIO_BSRR_BR5;

//			TIM1 -> CCR2 = 0;
//			TIM1 -> CCR3 = 0;
//			GPIOC -> BSRR |= GPIO_BSRR_BR13;
//			GPIOC -> BSRR |= GPIO_BSRR_BR14;
//			TIM3 -> CCR1 = 0;
//			TIM3 -> CCR2 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR11;
//			GPIOA -> BSRR |= GPIO_BSRR_BR12;
//			GPIOA -> BSRR |= GPIO_BSRR_BR0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR1;
//			GPIOA -> BSRR |= GPIO_BSRR_BR2;
//			GPIOC -> BSRR |= GPIO_BSRR_BR15;
//			GPIOA -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR5;
//			GPIOB -> BSRR |= GPIO_BSRR_BR6;
//			GPIOB -> BSRR |= GPIO_BSRR_BR7;
//			GPIOB -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}

		else if(A=='P')//Backward
		{
			GPIOA -> BSRR |= GPIO_BSRR_BS4;
			GPIOA -> BSRR |= GPIO_BSRR_BS5;

//			TIM1 -> CCR2 = 0;
//			TIM1 -> CCR3 = 0;
//			GPIOC -> BSRR |= GPIO_BSRR_BR13;
//			GPIOC -> BSRR |= GPIO_BSRR_BR14;
//			TIM3 -> CCR1 = 0;
//			TIM3 -> CCR2 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR11;
//			GPIOA -> BSRR |= GPIO_BSRR_BR12;
//			GPIOA -> BSRR |= GPIO_BSRR_BR0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR1;
//			GPIOA -> BSRR |= GPIO_BSRR_BR2;
//			GPIOC -> BSRR |= GPIO_BSRR_BR15;
//			GPIOA -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR5;
//			GPIOB -> BSRR |= GPIO_BSRR_BR6;
//			GPIOB -> BSRR |= GPIO_BSRR_BR7;
//			GPIOB -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
	}

	if(A=='q' || A=='Q')//Roll q and Q
	{
		TIM3 -> CR1 |= TIM_CR1_CEN;
		TIM3 -> CCER |= TIM_CCER_CC1E;
		TIM3 -> CCER |= TIM_CCER_CC2E;

		TIM3 -> CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM3 -> CCMR1 |= TIM_CCMR1_OC1M_1;
		TIM3 -> CCMR1 |= TIM_CCMR1_OC1M_0;
		TIM3 -> CCMR1 |= TIM_CCMR1_OC2M_2;
		TIM3 -> CCMR1 |= TIM_CCMR1_OC2M_1;
		TIM3 -> CCMR1 |= TIM_CCMR1_OC2M_0;

		for(int i=0;i<2;i++)
		{
			emStop();
			roll = USART1-> DR;
			roll = roll - 48;
			roll1 = roll1*10 + roll;
		}

		roll1 = roll1 - 12;
		roll1 = roll1*1260;

		if(A=='q')//q forward
		{
			TIM3 -> CCR1 = roll1;
			TIM3 -> CCR2 = 0;

//			TIM1 -> CCR2 = 0;
//			TIM1 -> CCR3 = 0;
//			GPIOC -> BSRR |= GPIO_BSRR_BR13;
//			GPIOC -> BSRR |= GPIO_BSRR_BR14;
//			GPIOA -> BSRR |= GPIO_BSRR_BR4;
//			GPIOA -> BSRR |= GPIO_BSRR_BR5;
//			GPIOA -> BSRR |= GPIO_BSRR_BR11;
//			GPIOA -> BSRR |= GPIO_BSRR_BR12;
//			GPIOA -> BSRR |= GPIO_BSRR_BR0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR1;
//			GPIOA -> BSRR |= GPIO_BSRR_BR2;
//			GPIOC -> BSRR |= GPIO_BSRR_BR15;
//			GPIOA -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR5;
//			GPIOB -> BSRR |= GPIO_BSRR_BR6;
//			GPIOB -> BSRR |= GPIO_BSRR_BR7;
//			GPIOB -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
		else if(A=='Q')//Q backward
		{
			TIM3 -> CCR1 = roll1;
			TIM3 -> CCR2 = 32768;

//			TIM1 -> CCR2 = 0;
//			TIM1 -> CCR3 = 0;
//			GPIOC -> BSRR |= GPIO_BSRR_BR13;
//			GPIOC -> BSRR |= GPIO_BSRR_BR14;
//			GPIOA -> BSRR |= GPIO_BSRR_BR4;
//			GPIOA -> BSRR |= GPIO_BSRR_BR5;
//			GPIOA -> BSRR |= GPIO_BSRR_BR11;
//			GPIOA -> BSRR |= GPIO_BSRR_BR12;
//			GPIOA -> BSRR |= GPIO_BSRR_BR0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR1;
//			GPIOA -> BSRR |= GPIO_BSRR_BR2;
//			GPIOC -> BSRR |= GPIO_BSRR_BR15;
//			GPIOA -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR5;
//			GPIOB -> BSRR |= GPIO_BSRR_BR6;
//			GPIOB -> BSRR |= GPIO_BSRR_BR7;
//			GPIOB -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
	}

	if(A=='g' || A=='G')//Gripper G g
	{
		if(A=='g')//forward g
		{
			GPIOA -> BSRR |= GPIO_BSRR_BS11;
			GPIOA -> BSRR |= GPIO_BSRR_BR12;

//			TIM1 -> CCR2 = 0;
//			TIM1 -> CCR3 = 0;
//			GPIOC -> BSRR |= GPIO_BSRR_BR13;
//			GPIOC -> BSRR |= GPIO_BSRR_BR14;
//			GPIOA -> BSRR |= GPIO_BSRR_BR4;
//			GPIOA -> BSRR |= GPIO_BSRR_BR5;
//			TIM3 -> CCR1 = 0;
//			TIM3 -> CCR2 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR1;
//			GPIOA -> BSRR |= GPIO_BSRR_BR2;
//			GPIOC -> BSRR |= GPIO_BSRR_BR15;
//			GPIOA -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR5;
//			GPIOB -> BSRR |= GPIO_BSRR_BR6;
//			GPIOB -> BSRR |= GPIO_BSRR_BR7;
//			GPIOB -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
		else if(A=='G')//Backward G
		{
			GPIOA -> BSRR |= GPIO_BSRR_BS11;
			GPIOA -> BSRR |= GPIO_BSRR_BS12;

//			TIM1 -> CCR2 = 0;
//			TIM1 -> CCR3 = 0;
//			GPIOC -> BSRR |= GPIO_BSRR_BR13;
//			GPIOC -> BSRR |= GPIO_BSRR_BR14;
//			GPIOA -> BSRR |= GPIO_BSRR_BR4;
//			GPIOA -> BSRR |= GPIO_BSRR_BR5;
//			TIM3 -> CCR1 = 0;
//			TIM3 -> CCR2 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR1;
//			GPIOA -> BSRR |= GPIO_BSRR_BR2;
//			GPIOC -> BSRR |= GPIO_BSRR_BR15;
//			GPIOA -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR5;
//			GPIOB -> BSRR |= GPIO_BSRR_BR6;
//			GPIOB -> BSRR |= GPIO_BSRR_BR7;
//			GPIOB -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
	}
	else if(A=='m'|| A=='M')//Camera 1
	{
		if(A=='m')
		{
			TIM1 -> CCR1 = 5000;
			GPIOB -> BSRR |= GPIO_BSRR_BR5;

