tanishqsngl/STM32f103/MotorC+RoboticA+Camera/src/main.c
//			TIM3 -> CCR4 = 0;//FL
//			TIM3 -> CCR3 = 0;//FR
//			TIM1 -> CCR2 = 0;
//			TIM1 -> CCR3 = 0;
//			GPIOC -> BSRR |= GPIO_BSRR_BR13;
//			GPIOC -> BSRR |= GPIO_BSRR_BR14;
//			GPIOA -> BSRR |= GPIO_BSRR_BR4;
//			GPIOA -> BSRR |= GPIO_BSRR_BR5;
//			TIM3 -> CCR1 = 0;
//			TIM3 -> CCR2 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR11;
//			GPIOA -> BSRR |= GPIO_BSRR_BR12;
//			GPIOA -> BSRR |= GPIO_BSRR_BR0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR1;
//			GPIOA -> BSRR |= GPIO_BSRR_BR2;
//			GPIOC -> BSRR |= GPIO_BSRR_BR15;
//			GPIOB -> BSRR |= GPIO_BSRR_BR6;
//			GPIOB -> BSRR |= GPIO_BSRR_BR7;
//			GPIOB -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
		else if(A=='M')
		{
			TIM1 -> CCR1 = 5000;
			GPIOB -> BSRR |= GPIO_BSRR_BS5;

//			TIM3 -> CCR4 = 0;//FL
//			TIM3 -> CCR3 = 0;//FR
//			TIM1 -> CCR2 = 0;
//			TIM1 -> CCR3 = 0;
//			GPIOC -> BSRR |= GPIO_BSRR_BR13;
//			GPIOC -> BSRR |= GPIO_BSRR_BR14;
//			GPIOA -> BSRR |= GPIO_BSRR_BR4;
//			GPIOA -> BSRR |= GPIO_BSRR_BR5;
//			TIM3 -> CCR1 = 0;
//			TIM3 -> CCR2 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR11;
//			GPIOA -> BSRR |= GPIO_BSRR_BR12;
//			GPIOA -> BSRR |= GPIO_BSRR_BR0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR1;
//			GPIOA -> BSRR |= GPIO_BSRR_BR2;
//			GPIOC -> BSRR |= GPIO_BSRR_BR15;
//			GPIOB -> BSRR |= GPIO_BSRR_BR6;
//			GPIOB -> BSRR |= GPIO_BSRR_BR7;
//			GPIOB -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
	}
	else if(A=='n'||A=='N')//Camera 2
	{
		if(A=='n')
		{
			GPIOB -> BSRR |= GPIO_BSRR_BS6;
			GPIOB -> BSRR |= GPIO_BSRR_BR7;

//			TIM3 -> CCR4 = 0;//FL
//			TIM3 -> CCR3 = 0;//FR
//			TIM1 -> CCR2 = 0;
//			TIM1 -> CCR3 = 0;
//			GPIOC -> BSRR |= GPIO_BSRR_BR13;
//			GPIOC -> BSRR |= GPIO_BSRR_BR14;
//			GPIOA -> BSRR |= GPIO_BSRR_BR4;
//			GPIOA -> BSRR |= GPIO_BSRR_BR5;
//			TIM3 -> CCR1 = 0;
//			TIM3 -> CCR2 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR11;
//			GPIOA -> BSRR |= GPIO_BSRR_BR12;
//			GPIOA -> BSRR |= GPIO_BSRR_BR0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR1;
//			GPIOA -> BSRR |= GPIO_BSRR_BR2;
//			GPIOC -> BSRR |= GPIO_BSRR_BR15;
//			GPIOA -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR5;
//			GPIOB -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
		else if(A=='N')
		{
			GPIOB -> BSRR |= GPIO_BSRR_BS6;
			GPIOB -> BSRR |= GPIO_BSRR_BS7;

//			TIM3 -> CCR4 = 0;//FL
//			TIM3 -> CCR3 = 0;//FR
//			TIM1 -> CCR2 = 0;
//			TIM1 -> CCR3 = 0;
//			GPIOC -> BSRR |= GPIO_BSRR_BR13;
//			GPIOC -> BSRR |= GPIO_BSRR_BR14;
//			GPIOA -> BSRR |= GPIO_BSRR_BR4;
//			GPIOA -> BSRR |= GPIO_BSRR_BR5;
//			TIM3 -> CCR1 = 0;
//			TIM3 -> CCR2 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR11;
//			GPIOA -> BSRR |= GPIO_BSRR_BR12;
//			GPIOA -> BSRR |= GPIO_BSRR_BR0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR1;
//			GPIOA -> BSRR |= GPIO_BSRR_BR2;
//			GPIOC -> BSRR |= GPIO_BSRR_BR15;
//			GPIOA -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR5;
//			GPIOB -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR9;
		}
	}
	else if(A=='f'||A=='F')//Container
	{
		if(A=='f')
		{
			GPIOB -> BSRR |= GPIO_BSRR_BS8;
			GPIOB -> BSRR |= GPIO_BSRR_BR9;

//			TIM3 -> CCR4 = 0;//FL
//			TIM3 -> CCR3 = 0;//FR
//			TIM1 -> CCR2 = 0;
//			TIM1 -> CCR3 = 0;
//			GPIOC -> BSRR |= GPIO_BSRR_BR13;
//			GPIOC -> BSRR |= GPIO_BSRR_BR14;
//			GPIOA -> BSRR |= GPIO_BSRR_BR4;
//			GPIOA -> BSRR |= GPIO_BSRR_BR5;
//			TIM3 -> CCR1 = 0;
//			TIM3 -> CCR2 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR11;
//			GPIOA -> BSRR |= GPIO_BSRR_BR12;
//			GPIOA -> BSRR |= GPIO_BSRR_BR0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR1;
//			GPIOA -> BSRR |= GPIO_BSRR_BR2;
//			GPIOC -> BSRR |= GPIO_BSRR_BR15;
//			GPIOA -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR5;
//			GPIOB -> BSRR |= GPIO_BSRR_BR6;
//			GPIOB -> BSRR |= GPIO_BSRR_BR7;
		}
		else if(A=='F')
		{
			GPIOB -> BSRR |= GPIO_BSRR_BS8;
			GPIOB -> BSRR |= GPIO_BSRR_BS9;

//			TIM3 -> CCR4 = 0;//FL
//			TIM3 -> CCR3 = 0;//FR
//			TIM1 -> CCR2 = 0;
//			TIM1 -> CCR3 = 0;
//			GPIOC -> BSRR |= GPIO_BSRR_BR13;
//			GPIOC -> BSRR |= GPIO_BSRR_BR14;
//			GPIOA -> BSRR |= GPIO_BSRR_BR4;
//			GPIOA -> BSRR |= GPIO_BSRR_BR5;
//			TIM3 -> CCR1 = 0;
//			TIM3 -> CCR2 = 0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR11;
//			GPIOA -> BSRR |= GPIO_BSRR_BR12;
//			GPIOA -> BSRR |= GPIO_BSRR_BR0;
//			GPIOA -> BSRR |= GPIO_BSRR_BR1;
//			GPIOA -> BSRR |= GPIO_BSRR_BR2;
//			GPIOC -> BSRR |= GPIO_BSRR_BR15;
//			GPIOA -> BSRR |= GPIO_BSRR_BR8;
//			GPIOB -> BSRR |= GPIO_BSRR_BR5;
//			GPIOB -> BSRR |= GPIO_BSRR_BR6;
//			GPIOB -> BSRR |= GPIO_BSRR_BR7;
		}
	}
	else if(A=='c')
	{
		TIM3 -> CCR4 = 0;//FL
		TIM3 -> CCR3 = 0;//FR
		TIM1 -> CCR2 = 0;
		TIM1 -> CCR3 = 0;
		TIM1 -> CCR1 = 0;
		GPIOC -> BSRR |= GPIO_BSRR_BR13;
		GPIOC -> BSRR |= GPIO_BSRR_BR14;
		GPIOA -> BSRR |= GPIO_BSRR_BR4;
		GPIOA -> BSRR |= GPIO_BSRR_BR5;
		TIM3 -> CCR1 = 0;
		TIM3 -> CCR2 = 0;
		GPIOA -> BSRR |= GPIO_BSRR_BR11;
		GPIOA -> BSRR |= GPIO_BSRR_BR12;
		GPIOA -> BSRR |= GPIO_BSRR_BR0;
		GPIOA -> BSRR |= GPIO_BSRR_BR1;
		GPIOA -> BSRR |= GPIO_BSRR_BR2;
		GPIOC -> BSRR |= GPIO_BSRR_BR15;
		GPIOA -> BSRR |= GPIO_BSRR_BR8;
		GPIOB -> BSRR |= GPIO_BSRR_BR5;
		GPIOB -> BSRR |= GPIO_BSRR_BR6;
		GPIOB -> BSRR |= GPIO_BSRR_BR7;
		GPIOB -> BSRR |= GPIO_BSRR_BR8;
		GPIOB -> BSRR |= GPIO_BSRR_BR9;
	}
	sBase = 0;
	sBase1 = 0;
	roll = 0;
	roll1 = 0;
	servoD = 0;
	servoD1 = 0;
}

int main()
{
	RCC -> APB2ENR |= RCC_APB2ENR_IOPAEN;
	RCC -> APB2ENR |= RCC_APB2ENR_IOPBEN;
	RCC -> APB2ENR |= RCC_APB2ENR_IOPCEN;
	RCC -> APB2ENR |= RCC_APB2ENR_USART1EN;
	RCC -> APB2ENR |= RCC_APB2ENR_AFIOEN;
	RCC -> CFGR &= ~(RCC_CFGR_PPRE2_0);
	RCC -> CFGR &= ~(RCC_CFGR_PPRE2_1);
	RCC -> CFGR |= RCC_CFGR_PPRE2_2;
	RCC -> APB1ENR |= RCC_APB1ENR_TIM2EN;
	RCC -> APB1ENR |= RCC_APB1ENR_TIM3EN;
	RCC -> APB2ENR |= RCC_APB2ENR_TIM1EN;

	timerSetup();

	GPIOSetup();

	UARTSetup();

	uint16_t A = 0;
	uint32_t x = 0;
	uint32_t y = 0;
	uint32_t x1 = 0;
	uint32_t y1 = 0;
	uint8_t z = 0;
	uint8_t z1 = 0;
	uint8_t w = 0;
	uint8_t w1 = 0;
	uint8_t c1=0;

	while(1)
	{
		USART1 -> CR1 |= USART_CR1_RE;

		emStop();
		A = USART1 -> DR;

		if(A == 'a')
		{
			TIM1 -> CCR2 = 0;
			TIM1 -> CCR3 = 0;
			TIM1 -> CCR1 = 0;
			GPIOC -> BSRR |= GPIO_BSRR_BR13;
			GPIOC -> BSRR |= GPIO_BSRR_BR14;
			GPIOA -> BSRR |= GPIO_BSRR_BR4;
			GPIOA -> BSRR |= GPIO_BSRR_BR5;
			TIM3 -> CCR1 = 0;
			TIM3 -> CCR2 = 0;
			GPIOA -> BSRR |= GPIO_BSRR_BR11;
			GPIOA -> BSRR |= GPIO_BSRR_BR12;
			GPIOA -> BSRR |= GPIO_BSRR_BR0;
			GPIOA -> BSRR |= GPIO_BSRR_BR1;
			GPIOA -> BSRR |= GPIO_BSRR_BR2;
			GPIOC -> BSRR |= GPIO_BSRR_BR15;
			GPIOB -> BSRR |= GPIO_BSRR_BR5;
			GPIOB -> BSRR |= GPIO_BSRR_BR6;
			GPIOB -> BSRR |= GPIO_BSRR_BR7;
			GPIOB -> BSRR |= GPIO_BSRR_BR8;
			GPIOB -> BSRR |= GPIO_BSRR_BR9;

			for(int i=0;i<4;i++)
			{
				emStop();
				x = USART1 -> DR;
				x = x - 48;
				x1 = x + x1*10;
			}
			//x1 is output

			for(int j=0;j<4;j++)
			{
				emStop();
				y = USART1 -> DR;
				y = y - 48;
				y1 = y + y1*10;
			}
			//y1 is output

			for(int k=0;k<2;k++)
			{
				emStop();
				z = USART1 -> DR;
				z = z - 48;
				z1 = z + z1*10;
			}

			emStop();
			w = USART1 -> DR;
			w = w - 48;
			w1 = w;

			emStop();
			c1 = USART1 -> DR;

			y1 = y1 - 1024;
			z1 = z1 - 13;
			x1 = x1 - 1024;

			if(x1==2047)
				x1=2048;

			if(y1==1)
				y1=0;

			x1 = x1*32;
			y1 = y1*32;

			if(x1==65536)
				x1=65535;

			if(y1==65536)
				y1=65535;

			motorCode(x1, y1, z1, w1, c1);

			x1=0;
			y1=0;
			z1=0;
			w1=0;
			c1=0;
		}

		else if(A=='r')
		{
			TIM3 -> CCR4 = 0;//FL
			TIM3 -> CCR3 = 0;//FR

			emStop();
			A = USART1 -> DR;

			RoboticArm(A);
		}
	}
}
